АлогистикТест2/src/Documents/алк_СменныйРапортОтходы/алк_СменныйРапортОтходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_СменныйРапортОтходы</name>
  <registerRecords>AccumulationRegister.алк_СменныйРапорт</registerRecords>
  <registerRecords>AccumulationRegister.алк_Отходы</registerRecords>
  <registerRecords>InformationRegister.алк_ДопАналитикаПакетов</registerRecords>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МастерОтходы</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеУпаковка</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодУпаковки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСостав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СертификатFSC</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемТаможня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоТаможня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБруттоТаможня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопАналитика</name>
      <type>
        <types>EnumRef.алк_ДопАналитикаПараметрыПакетовОперативный</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОперативныеДанныеУпаковка</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодУпаковки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСостав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СертификатFSC</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемТаможня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоТаможня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБруттоТаможня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Производство</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасформированныеПакеты</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПовторнаяУпаковка</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПередачаНаСГП</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВозвратС_СГП</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/AccumulationRegisters/алк_ВыпускПродукцииСерии/алк_ВыпускПродукцииСерии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ВыпускПродукцииСерии</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоПакетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыПакетов/алк_ПараметрыПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыПакетов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НомерПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодПакета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСостав</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>СертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодУпаковки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>БоковаяДоска</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </resources>
  <resources>
    <name>Габарит</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </resources>
  <resources>
    <name>Сухой</name>
    <comment>Для пакетов СП</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Припуск</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </resources>
  <resources>
    <name>ПризнакНЗП</name>
    <type>
      <types>EnumRef.алк_ПризнакНЗП</types>
    </type>
  </resources>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыХарактеристик/алк_ПараметрыХарактеристик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыХарактеристик</name>
  <resources>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </resources>
  <resources>
    <name>Сорт</name>
    <type>
      <types>CatalogRef.Сорта</types>
    </type>
  </resources>
  <resources>
    <name>Длина</name>
    <type>
      <types>CatalogRef.Длины</types>
    </type>
  </resources>
  <resources>
    <name>Сечение</name>
    <type>
      <types>CatalogRef.РазмерСечения</types>
    </type>
  </resources>
  <resources>
    <name>Поверхность</name>
    <type>
      <types>CatalogRef.Поверхности</types>
    </type>
  </resources>
  <resources>
    <name>Влажность</name>
    <type>
      <types>CatalogRef.Влажность</types>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <comment>Расчетный объем одной штуки исходя из размера. Заполняется при записи набора</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КоличествоРеквизитов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/AccumulationRegisters/алк_ЗапасыНаСкладахСерии/алк_ЗапасыНаСкладахСерии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ЗапасыНаСкладахСерии</name>
  <resources>
    <name>КоличествоПакетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>EnumRef.алк_ВидыОперацийПеремещениеЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/Enums/алк_ОперативнаяАктуальностьПакетов/алк_ОперативнаяАктуальностьПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ОперативнаяАктуальностьПакетов</name>
  <enumValues>
    <name>Актуален</name>
  </enumValues>
  <enumValues>
    <name>Изменен</name>
  </enumValues>
  <enumValues>
    <name>Удален</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_СменныйРапортОтходы/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);  
	
	УчастокПриИзмененииНаСервере();
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

///////////////////////////////// ТП "Т_Распилено" ////////////////////////////////////

&НаКлиенте
Процедура Т_РаспиленоКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Т_Распилено.ТекущиеДанные;
	РфпРаботаСДокументами.ПересчитатьОбъемСтроки(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура Т_РаспиленоХарактеристикаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Т_Распилено.ТекущиеДанные;
	РфпРаботаСДокументами.ПересчитатьОбъемСтроки(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура Т_РаспиленоНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Т_РаспиленоПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Т_РаспиленоПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		МассивКлючей = Новый Массив;
		
		Для каждого стрРаспилено Из Объект.Т_Распилено Цикл
			
			МассивКлючей.Добавить(стрРаспилено.КлючСвязи);
			
		КонецЦикла; 
		
		МаксЭлемент = РфпОбщегоНазначенияКлиент.МаксимальныйЭлементМассива(МассивКлючей);
		
		Если МаксЭлемент <> Неопределено Тогда
			
			Элемент.ТекущиеДанные.КлючСвязи = МаксЭлемент.Значение + 1;
			
		Иначе
			
			Элемент.ТекущиеДанные.КлючСвязи = 1;
			
		КонецЕсли; 
		
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Т_ВыходПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.Т_Распилено.ТекущиеДанные = Неопределено Тогда
		
		Отказ = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Т_ВыходПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Элементы.Т_Распилено.ТекущиеДанные <> Неопределено Тогда
		
		Элементы.Т_Выход.ТекущиеДанные.КлючСвязи    = Элементы.Т_Распилено.ТекущиеДанные.КлючСвязи;
		
		УстановитьОтборТаблицы(Элемент);
		
	Иначе
		
		ОтменаРедактирования = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Т_РаспиленоПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборТаблицы(Элемент);	
	
КонецПроцедуры

&НаКлиенте
Процедура Т_РаспиленоПередУдалением(Элемент, Отказ)
	
	КлючКУдалению = Элемент.ТекущиеДанные.КлючСвязи;
	
	Индекс = Объект.Т_Выход.Количество() - 1; 
	
	Пока Индекс >= 0 Цикл 
		
		Если Объект.Т_Выход[Индекс].КлючСвязи = КлючКУдалению Тогда 
			Объект.Т_Выход.Удалить(Индекс); 
		КонецЕсли; 
		
		Индекс = Индекс - 1; 
		
	КонецЦикла;	

КонецПроцедуры

///////////////////////////////// ТП "Т_Выход" ////////////////////////////////////

&НаКлиенте
Процедура Т_ВыходКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Т_Выход.ТекущиеДанные;
	РфпРаботаСДокументами.ПересчитатьОбъемСтроки(СтрокаТабличнойЧасти);

КонецПроцедуры

&НаКлиенте
Процедура Т_ВыходХарактеристикаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Т_Выход.ТекущиеДанные;
	РфпРаботаСДокументами.ПересчитатьОбъемСтроки(СтрокаТабличнойЧасти);

КонецПроцедуры

#КонецОбласти 


#Область ОбработкаКомманд

&НаСервере
Процедура ЗаполнитьРапортНаСервере()
	
	ЗаполнитьДанныеУпаковкаНаСервере();

	//ЗаполнитьДанныеОтходыНаСервере();
	//ЗаполнитьДанныеСГПНаСервере();
	//ЗаполнитьДанныеУпаковкаНаСервере();
	//ЗаполнитьДанныеСырьеНаСервере();
	//ЗаполнитьДанныеСортировкаНаСервере();
	//ЗаполнитьДанныеПриемкаСырьяНаСервере();
	//ЗаполнитьДанныеПереупаковкаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРапорт(Команда)
	ЗаполнитьРапортНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеУпаковкаНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РабочиеРегистры.Организация,
	|	РабочиеРегистры.Номенклатура,
	|	РабочиеРегистры.Характеристика,
	|	РабочиеРегистры.ЗаказПокупателя,
	|	РабочиеРегистры.СерийныйНомер,
	|	РабочиеРегистры.ДатаСмены,
	|	РабочиеРегистры.Смена,
	|	РабочиеРегистры.КоличествоПакетовОборот,
	|	РабочиеРегистры.ПериодУпаковки,
	|	РабочиеРегистры.КоличествоСостав,
	|	РабочиеРегистры.Объем,
	|	РабочиеРегистры.СертификатFSC,
	|	РабочиеРегистры.ОбъемТаможня,
	|	РабочиеРегистры.ВесНеттоТаможня,
	|	РабочиеРегистры.ВесБруттоТаможня,
	|	ОперативныйРегистр.ДопАналитика КАК ДопАналитика
	|ИЗ
	|	(ВЫБРАТЬ
	|		алк_ВыпускПродукцииСерииОбороты.Организация КАК Организация,
	|		алк_ВыпускПродукцииСерииОбороты.Номенклатура КАК Номенклатура,
	|		алк_ВыпускПродукцииСерииОбороты.Характеристика КАК Характеристика,
	|		алк_ВыпускПродукцииСерииОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
	|		алк_ВыпускПродукцииСерииОбороты.СерийныйНомер КАК СерийныйНомер,
	|		алк_ВыпускПродукцииСерииОбороты.ДатаСмены КАК ДатаСмены,
	|		алк_ВыпускПродукцииСерииОбороты.Смена КАК Смена,
	|		алк_ВыпускПродукцииСерииОбороты.КоличествоПакетовОборот КАК КоличествоПакетовОборот,
	|		алк_ПараметрыПакетовСрезПоследних.ПериодУпаковки КАК ПериодУпаковки,
	|		алк_ПараметрыПакетовСрезПоследних.КоличествоСостав КАК КоличествоСостав,
	|		алк_ПараметрыПакетовСрезПоследних.Объем КАК Объем,
	|		алк_ПараметрыПакетовСрезПоследних.СертификатFSC КАК СертификатFSC,
	|		алк_ПараметрыПакетовСрезПоследних.ОбъемТаможня КАК ОбъемТаможня,
	|		алк_ПараметрыПакетовСрезПоследних.ВесНеттоТаможня КАК ВесНеттоТаможня,
	|		алк_ПараметрыПакетовСрезПоследних.ВесБруттоТаможня КАК ВесБруттоТаможня
	|	ИЗ
	|		РегистрНакопления.алк_ВыпускПродукцииСерии.Обороты(
	|				,
	|				,
	|				Запись,
	|				ДатаСмены = &ДатаСмены
	|					И Смена = &Смена
	|					И Номенклатура.КатегорияНоменклатуры В (&спКатегорияОтходы)) КАК алк_ВыпускПродукцииСерииОбороты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(, ) КАК алк_ПараметрыПакетовСрезПоследних
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|				ПО алк_ПараметрыПакетовСрезПоследних.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|			ПО алк_ВыпускПродукцииСерииОбороты.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер) КАК РабочиеРегистры
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			алк_ПараметрыПакетовОперативныйСрезПоследних.СерийныйНомер КАК СерийныйНомер,
	|			алк_ПараметрыПакетовОперативныйСрезПоследних.ДопАналитика КАК ДопАналитика
	|		ИЗ
	|			РегистрСведений.алк_ПараметрыПакетовОперативный.СрезПоследних(
	|					,
	|					Актуальность = ЗНАЧЕНИЕ(Перечисление.алк_ОперативнаяАктуальностьПакетов.Актуален)
	|						И ДатаСмены = &ДатаСмены
	|						И Смена = &Смена) КАК алк_ПараметрыПакетовОперативныйСрезПоследних) КАК ОперативныйРегистр
	|		ПО РабочиеРегистры.СерийныйНомер = ОперативныйРегистр.СерийныйНомер";
	
	Запрос.УстановитьПараметр("ДатаСмены", Объект.ДатаСмены);
	Запрос.УстановитьПараметр("Смена", Объект.Смена);
	
	спКатегорияОтходы = Новый СписокЗначений;
	спКатегорияОтходы.Добавить(Справочники.КатегорииНоменклатуры.ШпонКусковой);
	спКатегорияОтходы.Добавить(Справочники.КатегорииНоменклатуры.Карандаши);
	спКатегорияОтходы.Добавить(Справочники.КатегорииНоменклатуры.НайтиПоКоду("ПБ-000005")); //Чурак оцилиндрованный (кат)
	
	Запрос.УстановитьПараметр("спКатегорияОтходы", спКатегорияОтходы);

	РезультатЗапроса = Запрос.Выполнить();  // РезультатЗапроса.Выгрузить()
	
	Объект.ДанныеУпаковка.Загрузить(РезультатЗапроса.Выгрузить());
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеУпаковка(Команда)
	
	ПроверитьЗаполениеРеквизитовСмены();
	ЗаполнитьДанныеУпаковкаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСГПНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	алк_ЗапасыНаСкладахСерии.Организация,
	|	алк_ЗапасыНаСкладахСерии.СтруктурнаяЕдиница,
	|	алк_ЗапасыНаСкладахСерии.Ячейка,
	|	алк_ЗапасыНаСкладахСерии.Номенклатура,
	|	алк_ЗапасыНаСкладахСерии.СерийныйНомер,
	|	алк_ЗапасыНаСкладахСерии.ЗаказПокупателя,
	|	алк_ЗапасыНаСкладахСерии.КоличествоПакетов,
	|	алк_ЗапасыНаСкладахСерии.ДатаСмены,
	|	алк_ЗапасыНаСкладахСерии.Смена
	|ИЗ
	|	РегистрНакопления.алк_ЗапасыНаСкладахСерии КАК алк_ЗапасыНаСкладахСерии
	|ГДЕ
	|	алк_ЗапасыНаСкладахСерии.Активность
	|	И алк_ЗапасыНаСкладахСерии.СтруктурнаяЕдиница = &СГП
	|	И алк_ЗапасыНаСкладахСерии.ДатаСмены = &ДатаСмены
	|	И алк_ЗапасыНаСкладахСерии.Смена = &Смена
	|	И алк_ЗапасыНаСкладахСерии.Операция = ЗНАЧЕНИЕ(Перечисление.алк_ВидыОперацийПеремещениеЗапасов.ПередачаИзПроизводства)
	|	И алк_ЗапасыНаСкладахСерии.ВидДвижения = &ВидДвижения";
	
	Запрос.УстановитьПараметр("ДатаСмены", Объект.ДатаСмены);
	Запрос.УстановитьПараметр("Смена", Объект.Смена);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("СГП", РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.СГП));
	
	РезультатЗапроса = Запрос.Выполнить();  //РезультатЗапроса.Выгрузить()
	Объект.ПередачаНаСГП.Загрузить(РезультатЗапроса.Выгрузить());
	
	ТекстЗапроса = Запрос.Текст;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "ПередачаИзПроизводства", "ВозвратНаПроизводство");
	
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
	
	РезультатЗапроса = Запрос.Выполнить();  //РезультатЗапроса.Выгрузить()
	Объект.ВозвратС_СГП.Загрузить(РезультатЗапроса.Выгрузить());
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеСГП(Команда)
	
	ПроверитьЗаполениеРеквизитовСмены();
	ЗаполнитьДанныеСГПНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСырьеНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	алк_ЗапасыОрганизации.Организация,
	|	алк_ЗапасыОрганизации.СтруктурнаяЕдиница,
	|	алк_ЗапасыОрганизации.Ячейка,
	|	алк_ЗапасыОрганизации.Номенклатура,
	|	алк_ЗапасыОрганизации.ДатаСмены,
	|	алк_ЗапасыОрганизации.Смена,
	|	алк_ЗапасыОрганизации.Количество,
	|	алк_ЗапасыОрганизации.Объем,
	|	алк_ЗапасыОрганизации.Характеристика
	|ИЗ
	|	РегистрНакопления.алк_ЗапасыОрганизации КАК алк_ЗапасыОрганизации
	|ГДЕ
	|	алк_ЗапасыОрганизации.Активность
	|	И алк_ЗапасыОрганизации.СтруктурнаяЕдиница = &Участок
	|	И алк_ЗапасыОрганизации.ДатаСмены = &ДатаСмены
	|	И алк_ЗапасыОрганизации.Смена = &Смена
	|	И алк_ЗапасыОрганизации.Операция = ЗНАЧЕНИЕ(Перечисление.алк_ВидыОперацийПеремещениеЗапасов.ПередачаНаПроизводство)
	|	И алк_ЗапасыОрганизации.ВидДвижения = &ВидДвижения";
	
	Запрос.УстановитьПараметр("ДатаСмены", Объект.ДатаСмены);
	Запрос.УстановитьПараметр("Смена", Объект.Смена);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("Участок", РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.УчастокСортированныхЛМ));
	
	РезультатЗапроса = Запрос.Выполнить();  //РезультатЗапроса.Выгрузить()
	Объект.ПереданоСырьяВПроизводство.Загрузить(РезультатЗапроса.Выгрузить());
	
	ТекстЗапроса = Запрос.Текст;
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "ПередачаНаПроизводство", "ВозвратИзПроизводства");
	
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
	
	РезультатЗапроса = Запрос.Выполнить();  //РезультатЗапроса.Выгрузить()
	//Объект.ВозвратС_СГП.Загрузить(РезультатЗапроса.Выгрузить());	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеСырье(Команда)
	ЗаполнитьДанныеСырьеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСортировкаНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_СортировкаЛесопродукцииОбороты.Номенклатура,
	|	алк_СортировкаЛесопродукцииОбороты.Партия,
	|	алк_СортировкаЛесопродукцииОбороты.Порода,
	|	алк_СортировкаЛесопродукцииОбороты.Сорт,
	|	алк_СортировкаЛесопродукцииОбороты.Длина,
	|	алк_СортировкаЛесопродукцииОбороты.Сечение,
	|	алк_СортировкаЛесопродукцииОбороты.КоличествоОборот КАК Количество,
	|	алк_СортировкаЛесопродукцииОбороты.ОбъемОборот КАК Объем
	|ИЗ
	|	РегистрНакопления.алк_СортировкаЛесопродукции.Обороты КАК алк_СортировкаЛесопродукцииОбороты
	|ГДЕ
	|	алк_СортировкаЛесопродукцииОбороты.ДатаСмены = &ДатаСмены
	|	И алк_СортировкаЛесопродукцииОбороты.Смена = &Смена";
	
	Запрос.УстановитьПараметр("ДатаСмены", Объект.ДатаСмены);
	Запрос.УстановитьПараметр("Смена", Объект.Смена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	РезультатЗапроса = Запрос.Выполнить();  //РезультатЗапроса.Выгрузить()
	Объект.Сортировка.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеСортировка(Команда)
	ЗаполнитьДанныеСортировкаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПриемкаСырьяНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(алк_ЗапасыОрганизацииОбороты.КоличествоПриход) КАК Количество,
	|	СУММА(алк_ЗапасыОрганизацииОбороты.ОбъемПриход) КАК Объем,
	|	алк_ЗапасыОрганизацииОбороты.Номенклатура,
	|	алк_ЗапасыОрганизацииОбороты.Характеристика,
	|	алк_ЗапасыОрганизацииОбороты.Регистратор.ВидТранспортировки КАК ВидТранспортировки,
	|	алк_ЗапасыОрганизацииОбороты.Ячейка КАК Штабель
	|ИЗ
	|	РегистрНакопления.алк_ЗапасыОрганизации.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			ДатаСмены = &ДатаСмены
	|				И Смена = &Смена
	|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК алк_ЗапасыОрганизацииОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	алк_ЗапасыОрганизацииОбороты.Номенклатура,
	|	алк_ЗапасыОрганизацииОбороты.Регистратор.ВидТранспортировки,
	|	алк_ЗапасыОрганизацииОбороты.Характеристика,
	|	алк_ЗапасыОрганизацииОбороты.Ячейка";
	
	Запрос.УстановитьПараметр("ДатаСмены", Объект.ДатаСмены);
	Запрос.УстановитьПараметр("Смена", Объект.Смена);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.УчастокСортированныхЛМ));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.ПринятоСырьяУСЛ.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПриемкаСырья(Команда)
	ЗаполнитьДанныеПриемкаСырьяНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПереупаковкаНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПереупаковка(Команда)
	ЗаполнитьДанныеПереупаковкаНаСервере();
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиБиблиотек

///////////////////////////////////////////////////// Подключаемые //////////////////////////////////////////////

// СтандартныеПодсистемы.Печать

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	// УНФ
	СтатистикаИспользованияФормКлиент.ДобавитьСтатистикуКомандПечати(ЭтотОбъект, Команда);
	// Конец УНФ
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать


#КонецОбласти 


#Область СлужебныеПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполениеРеквизитовСмены()
	
	Если Не ЗначениеЗаполнено(Объект.ДатаСмены) ИЛИ Не ЗначениеЗаполнено(Объект.Смена) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните реквизиты смены!";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли; 
	
КонецПроцедуры


#КонецОбласти 


#Область ИнтерфейсныеПроцедуры

&НаКлиенте
Процедура УстановитьОтборТаблицы(Элемент)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		
		СтруктураОтбора = Новый ФиксированнаяСтруктура("КлючСвязи", Элемент.ТекущиеДанные.КлючСвязи);
		
		Элементы.Т_Выход.ОтборСтрок = СтруктураОтбора;
		
	Иначе
		
		Элементы.Т_Выход.ОтборСтрок = Неопределено;
		
	КонецЕсли; 
	
КонецПроцедуры // УстановитьОтборТаблицы

	
#КонецОбласти 


Процедура Конец()	
КонецПроцедуры

&НаСервере
Процедура УчастокПриИзмененииНаСервере()
	Элементы.Смена.ПараметрыВыбора = РфпСервер.ПолучитьОтборПоТипуСмены(Объект.Участок, Объект.ДатаСмены);
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры
